-- 판매자 계정 생성
INSERT INTO member (user_id, email, password, name, role_type, created_at, modified_at, created_by, modified_by)
VALUES ('test' ,'test@test.com', '{noop}qwer1234', 'John', 'SELLER', '2025-02-10 17:50:00', '2025-02-10 17:50:00', 'yunho', 'yunho');

-- 1. 대분류 (남성의류, 여성의류, 신발, 모자)
INSERT INTO category (name, parent_id, depth) VALUES
                                                ('남성의류', NULL, 1),  -- ID 1
                                                ('여성의류', NULL, 1),  -- ID 2
                                                ('신발', NULL, 1),  -- ID 3
                                                ('모자', NULL, 1);  -- ID 4

-- 2. 중분류 (상의, 하의, 신발, 모자 등)
INSERT INTO category (name, parent_id, depth) VALUES
                                                ('상의', 1, 2),  -- ID 5 (남성의류 - 상의)
                                                ('하의', 1, 2),  -- ID 6 (남성의류 - 하의)
                                                ('상의', 2, 2),  -- ID 7 (여성의류 - 상의)
                                                ('하의', 2, 2),  -- ID 8 (여성의류 - 하의)
                                                ('원피스', 2, 2),  -- ID 9 (여성의류 - 원피스)
                                                ('남성 신발', 3, 2),  -- ID 10
                                                ('여성 신발', 3, 2),  -- ID 11
                                                ('남성 모자', 4, 2),  -- ID 12
                                                ('여성 모자', 4, 2);  -- ID 13

-- 3. 소분류 (티셔츠, 청바지, 운동화, 캡모자 등)
INSERT INTO category (name, parent_id, depth) VALUES
-- 남성 상의
('티셔츠', 5, 3), ('셔츠', 5, 3), ('니트', 5, 3),
-- 남성 하의
('청바지', 6, 3), ('슬랙스', 6, 3), ('반바지', 6, 3),
-- 여성 상의
('블라우스', 7, 3), ('티셔츠', 7, 3), ('니트', 7, 3),
-- 여성 하의
('스커트', 8, 3), ('청바지', 8, 3), ('슬랙스', 8, 3),
-- 남성 신발
('운동화', 10, 3), ('구두', 10, 3), ('샌들', 10, 3),
-- 여성 신발
('운동화', 11, 3), ('구두', 11, 3), ('샌들', 11, 3),
-- 남성 모자
('캡모자', 12, 3), ('비니', 12, 3), ('페도라', 12, 3),
-- 여성 모자
('캡모자', 13, 3), ('비니', 13, 3), ('버킷햇', 13, 3);

